# Level 32:

# საკლასო სამუშაო:


# # 1. შექმენით ფუნქცია, რომელიც გამოიტანს x და y ჯამს, მოახდინეთ ოპერაცია შემდეგ ოპერატორებზე: +, -. *. //

def count(x, y):
    print(x + y)
    print(x / y)
    print(x - y)
    print(x * y)
count(7, 9)

# # 2. შექმენით ფუნქცია, რომელიც მიესალმება მომხმარებელს.

# ტექსტი: 'გამარჯობა {სახელი}, კეთილი იყოს შენი მობრძანება,  გისურვებ წარმატებას და წინ სვლას"

def hello(hello):
    print("გამარჯობა " + hello + " კეთილი იყოს შენი მობრძანება, გისურვებ წარმატებას და წინ სვლას")
hello("Nikoloz")


# # 3.  შექმენით ფუნქცია, რომელიც სიყვარულის წერილს მიუძღვნის მომხმარებელს:

# ტექსტი თქვენ მოიფიქრეთ.

# ტექსტის ბოლოს აუცილებლად ჩაამატეთ ეს ნაწილი: 'სიყვარულით {სახელი}' 

def love_letter(name):
    print("მიყვარხარ და მენატრები. სიყვარულით " + name)
love_letter("Nika")




# # 4. შექმენით ფუნქცია, სადაც შემოიტანთ თქვენს თავზე ინფორმაცია, სახელი, გვარი, ასაკი, ქვეყანა, ქალაქი, საყვარელი ჰობი და ა.შ

# შემდე ფუნქციის დახმარებით ააგეთ ერთი დიდი წინადადება.

def information(firstname, lastname, age, country, city, favorite_hobby):
    print("გამარჯობა, ჩემი სახელია " + firstname + " " + lastname + "მე ვარ " + str(age) + " წლის, ვარ"  + country + "-დან და ვცხოვრობ " + city + ". ჩემი საყვარელი ჰობია " + favorite_hobby)
information("ნიკოლოზ", "თევდორაძე", 16, "საქართველო", "თბილისი", "პროგრამირება.")


# # 5.გამოთვალეთ მართკუთხედის ფართობი


# 1. შექმენით ფუქნქცია, რომელსაც ეწოდება calculate_area

# 2. ამ ფუნქციაში უნდა იყვეს ორი პარამეტრი, length და width

# გამოიყენეთ ფორმულა, area = length * width

def calculate_area(length, width):
    print("Square of this parameters is", length * width) #შემეძლო გადამექცია ეს ნამრავლი სტრინგადაც
calculate_area(int(input("Enter Square Length: ")), int(input("Enter Square Width")))

# # 6. მაქსიმალური რიცხვის პოვნა:

# 1. განსაზღვრეთ ფუნქცია სახელით find_max.

# 2. ფუნქციამ უნდა მიიღოს ორი პარამეტრი: num1 და num2 (ორივე მთელი ან წილადი რიცხვი).

# 3.ფუნქციამ უნდა შეადაროს ორი რიცხვი და დააბრუნოს მათი მაქსიმალური მნიშვნელობა.


def find_max(num1, num2):
    if num1 > num2:
        print(num1)
    else:
        print(num2)
print(find_max(2, 51))

# ====


# # 7. შექმენით ფუქნცია და შეამოწმეთ რიცხვი ლუწია თუ კენტი.

def Odd_Even(num):
    if num % 2 == 0:
        return "Even"
    else:
        return "Odd"
print(Odd_Even(int(input("Enter Number: "))))