# 1)გააკეთეთ ხუთ ხუთი მაგალითი ყველა გავლილ მათემატიკურ ოპერატორზე.

print(5 + 121)
print(934 + 123)
print(1313 + 7543)
print(665 + 312)
print(5318 + 432)

print(5 - 16)
print(75 - 21)
print(665 - 131)
print(99121 - 9912)
print(542 - 66)

print(12 * 66)
print(765 * 124)
print(532 * 531)
print(551 * 663)
print(55642 * 5612)

print(500 / 50)
print(625 / 25)
print(750 / 250)
print(1000 / 100)
print(5 / 66)

# 2)შექმენით ცვლადი age და მნიშვნელობად გადაეცით თქვენი ასაკი, შექმენით ახალი ცვლადი სადაც იქნება თქვენი ასაკი 5 წლის შემდეგ, ბოლოს კი გამოიტანეთ ეს ცვლადი.

age = 16
age = 16 + 5
print(age)

# 3)თქვენი ოჯახის წევრების ასაკები შეინახეთ ცვლადებში და დაითვალეთ ყველა ასაკის ჯამი.

my_age = 16
my_brother_age = 14
my_mother_age = 45
my_father_age = 46

print(my_age + my_brother_age + my_mother_age + my_father_age)

# 4)შექმენით ცვლადი name რომელშიც შეინახავთ თქვენ სახელს და შემდეგ განაახლეთ ამ ცვლადის მნიშვნელობა და ჩაწერეთ თქვენი მეგობრის სახელი, საბოლოოდ დაბეჭდეთ name ცვლადი

name = "Nikolozi"
name = "Giorgi"

print(name)
